#!/bin/bash

echo -e '\e[1;36m调色板\e[0m'
echo

echo '使用代码示例：'
echo '    echo -e "\e[1;mx\e[0m"'
echo '    echo -e "\e[1;36mx\e[0m"'
echo '    echo -e "\e[1;36;42mx\e[0m"'
echo

echo -e '\e[1m语法：\e[0m'
echo '    echo -e "\e[<颜色代码列表>m这里是内容\e[0m"'
echo
echo '        \e[表示设置颜色命令的开始，m表示设置颜色命令的结束。'
echo '    中间的颜色代码列表，如果有多个颜色代码，需要用英文分号分隔。'
echo '    多个颜色代码的，后面设置的代码会覆盖掉先前设置的同类的代码。'
echo '    比如：echo -e "\e[33;44;36m我"，33和36同为前景色，有冲突，'
echo '    36覆盖了34。'
echo

echo -e '\e[1m说明：\e[0m'
echo '    样式代码：从0到9'
echo '    前景色代码：从30到37'
echo '    背景色代码：从40到47'
echo
echo -e '\e[1m原理：\e[0m'
echo '    echo 的参数 -e 表示启用转义字符，\e是不可见的ESC转义字符。' 
echo '    具体的前景色和背景色由终端来定义。可以在设置的调色板中自定义。'
echo '    颜色代码实际上可以根据加法三原色推算出来，比如：'
echo '    黄色BGR(0,1,1)，根据二进制转十进制运算可得，'
echo '    颜色代码个位数 = 0b011 = 3'
echo

echo    '  前景色代码     背景色代码        颜色     B G R'
echo    '--------------------------------------------------'
echo -e '  30                40           \e[40m  \e[0m 黑色    0 0 0'
echo -e '  31                41           \e[41m  \e[0m 紅色    0 0 1'
echo -e '  32                42           \e[42m  \e[0m 綠色    0 1 0'
echo -e '  33                43           \e[43m  \e[0m 黃色    0 1 1'
echo -e '  34                44           \e[44m  \e[0m 藍色    1 0 0'
echo -e '  35                45           \e[45m  \e[0m 紫色    1 0 1'
echo -e '  36                46           \e[46m  \e[0m 青色    1 1 0'
echo -e '  37                47           \e[47m  \e[0m 白色    1 1 1'
echo

echo    '  代码        样式           示例             备注'
echo    '----------------------------------------------------------'
echo -e '  0           正常 （复位）  \e[0m示例文字\e[0m    去除背景色、前景色、样式的设置。'
echo -e '  1           强调           \e[1m示例文字\e[0m    对文字进行高亮，加粗，通'
echo    '                                           常用浅色或者更鲜艳的颜色，'
echo    '                                           只对30～37的颜色起作用。'
echo -e '  2           灰暗           \e[2m示例文字\e[0m'
echo -e '  3           斜体           \e[3m示例文字\e[0m    允许与粗体（即：强调）叠加效果。'
echo -e '  4           下划线         \e[4m示例文字\e[0m    与删除线互斥。'
echo -e '  5           闪烁           \e[5m示例文字\e[0m    部分终端模拟器不支持。'
echo -e ' \e[9m 6 \e[0m          没有定义                   与复位不同，代码6使用后无效果。'
echo -e '  7           反色           \e[7m示例文字\e[0m    实际上是交换前景色和背景色的定义'
echo -e '  8           隐藏           \e[8m示例文字\e[0m    这里的"示例文字"被隐藏了。'
echo -e '  9           删除线         \e[9m示例文字\e[0m'
echo

echo -e "\e[1;37;41m                              以下是颜色码表                                \e[0m\n"
for r in '' ';7'			# r 反色
do
	for b in {40..47}		# b 背景色
	do
		for f in {30..37}	# f 前景色
		do
			s=""
			for l in 2 0 1	# l 亮度
			do
				s=${s}"\e[${l};${f};${b}${r}m ${l};${f};${b}${r} \e[0m"
			done
			echo -e ${s}
		done
		echo
	done
done

